src/runtime/web/scene06.org
#+TITLE:Merge sort experiment Scene-06
#+AUTHOR: VLEAD
#+DATE: [2017-12-11 MON]
#+SETUPFILE: ../../org-templates/level-2.org
#+TAGS: boilerplate(b)
#+EXCLUDE_TAGS: boilerplate
#+OPTIONS: ^:nil'

* Introduction
- This experiment demonstrates the merge sort algorithm with nodes and edges.
- In this experiment we show a recursive mergesort graph of an array the user is prompted to enter.
- We can click on the nodes of the mergesort graph which displays the recursive steps of mergesort algorithm.



* Code and narration
