src/runtime/web/scene06.org
** JS

- Global declaration of variables. 
- Node stores id of each node and corresponding string in the form of a dictionary.
- Mark stores whether a node is opened or not.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
var node={};
var vert=[];
var mark=[];
#+END_SRC

- =pane= function which handles the opening and closing of the top pane.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
// pane function for hiding or displaying the pane
var pane = function()
{
	var x = document.getElementsByClassName('bond');
	// it checks if the pane is hidden , and shows it if its hidden
	if(x[0].style.display == "none")
	{
	 	 x[0].style.display = "block";
	}
	// it hides the displayed pane on clicking the pane button
	else
	{
		x[0].style.display = "none";
	}
};
#+END_SRC

- =sort= function to call different functions in this file.
- It calls the =reset2= function to intialise the variables before sorting.
- Takes the input and handles the array accordingly.
- Calls the subsequent main function to generate the tree.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
function sort()
{
  reset2();
	var array=document.getElementById('arr').value;
	var arr=array.split(" ");
  array = array.trim();
	console.log(array);
	merge(array,1);
	mark[1]=1;
	drawGraph();
}
#+END_SRC

- Every time a node is clicked and is not opened.
- It generates the top node with id as i and bottom node with id as -i and in the bottom node the array is sorted.
- This add the nodes to the node array that we will use after in the draw to generate the final graph.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
function merge(arr,i)
{
	if(arr.length>=1)
	{
		vert.push(arr);
		node[i]=arr;
		mark[i]=1;
		var tp1=arr.split(' ');
		console.log(tp1);
		tp1.sort();
		var tp2=tp1.join(" ");
		console.log(tp2);
		node[-i]=tp2;
		vert.push(tp2);
	}
}
#+END_SRC

- Main function which handles the drawing of the graph.
- This would use the two node array to get the nodes and
  then use the mark to see which edges to add or not according to whether the node is opened or not.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
function drawGraph()
{
	for (v in node)
	{
		g.setNode(v,{ label: node[v],class: "type-TOP" });
	}


	for (v in node)
	{
		if(v>0)
		{
			if(mark[v]==0) // that means no edge from i to -i instead from i to 2*i and 2*i+1
			{
				g.setEdge(v,2*v,{label:"Split"});
        g.setEdge(v,2*v+1,{label:"Split"});
			}
			else //that means edge from i to -i
			{
        g.setEdge(v,-v,{label:"MS"});
			}
		}
		else
		{
			var dest=Math.floor(v/-2);
			console.log(v,dest);
			if(dest>0)
			{
        g.setEdge(v,-dest,{label:"Merge"});
			}
		}
	}
	draw();

}
#+END_SRC

- Dagre components.Graph definitions and routine function call to draw the graph.
- In this function to every node we have attached onclick handlers to each node and defined the function which will handle opening and closing.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
var g = new dagreD3.graphlib.Graph()
.setGraph({})
.setDefaultEdgeLabel(function() { return {}; });
function draw()
{
	g.nodes().forEach(function(v)
	{
		 var node = g.node(v);
	  	// Round the corners of the nodes
	  	node.rx = node.ry = 5;
	})

	// Create the renderer
	var render = new dagreD3.render();

	// Set up an SVG group so that we can translate the final graph.
	var svg = d3.select("svg"),
	svgGroup = svg.append("g");

	// Run the renderer. This is what draws the final graph.
	render(d3.select("svg g"), g);
#+END_SRC

- Main onclick handler which handles opening and closing of the nodes.
- If mark[v]==1 that implies node is not opened.
- To open this node break the string into two parts and call the merge function with appropriate Ids which will add these nodes to the Node dictionary.
- If mark[v]==0 that means we are clicking on the node to close it.
- If any of its children is open we are not closing the node.
- If both the childrens are closed then we delete them from node array.
- After making the changes we call the reset function and drargraph which redraws the entire graph.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
	d3.select("svg g").selectAll("g.node")
	.on("click", function(id)
	{
		if(id>0)
		{
			if(mark[id]==1) //node is not opened
			{
				var _node = g.node(id);
				mark[id]=0;
				console.log(id,_node);
				var array=_node.label;
				console.log(array);
				var mid=Math.floor(array.length/2);
				var tp1=array.substr(0,mid);
				var tp2=array.substr(mid,array.length-mid);
				merge(tp1,2*id);
				merge(tp2,2*id+1);
			}
			else if(mark[id]==0)
			{
				if(mark[2*id]==1 && mark[2*id+1]==1)
				{
					var _node = g.node(id);
					mark[id]=1;
					console.log(node);
					delete node[2*id];
					delete node[-(2*id)];
					delete node[2*id+1];
					delete node[-(2*id+1)];
				}

			}
			reset();
			drawGraph();
		}
	});

	// Center the graph
	var xCenterOffset = (svg.attr("width") - g.graph().width) / 2;
	svgGroup.attr("transform", "translate(" + xCenterOffset + ", 20)");
	svg.attr("height", g.graph().height + 40);

}
#+END_SRC

- Reset function which handles the resetting of the graph. 
- One reset handles the resetting of graph when nodes are clicked.
- Other handles the resetting when the reset button is clicked.
- =reset2= function is called before sort is called to intialise all the global variables.

#+BEGIN_SRC  javascript :tangle /static/js/merge.js :eval no :noweb yes
function reset()
{
	g = null
	g = new dagreD3.graphlib.Graph()
	.setGraph({})
	.setDefaultEdgeLabel(function() { return {}; });

}

function reset1()
{
	g = null
	g = new dagreD3.graphlib.Graph()
	.setGraph({})
	.setDefaultEdgeLabel(function() { return {}; });
	node={};
	vert=[];
	mark=[];
	render = null
	svg = null
	document.getElementById('svg-canvas').innerHTML = null
	document.getElementById('arr').value = null

}
function reset2()
{
  g = null
  g = new dagreD3.graphlib.Graph()
  .setGraph({})
  .setDefaultEdgeLabel(function() { return {}; });
  node={};
  vert=[];
  mark=[];
  render = null
  svg = null
  document.getElementById('svg-canvas').innerHTML = null
}
#+END_SRC

