build/docs/runtime/web/scene06.html
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">JS</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Global declaration of variables. 
</li>
<li>Node stores id of each node and corresponding string in the form of a dictionary.
</li>
<li>Mark stores whether a node is opened or not.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node</span>={};
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">vert</span>=[];
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mark</span>=[];
</pre>
</div>

<ul class="org-ul">
<li><code>pane</code> function which handles the opening and closing of the top pane.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">pane function for hiding or displaying the pane</span>
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">pane</span> = <span style="font-weight: bold;">function</span>()
{
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">x</span> = document.getElementsByClassName(<span style="font-style: italic;">'bond'</span>);
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">it checks if the pane is hidden , and shows it if its hidden</span>
        <span style="font-weight: bold;">if</span>(x[0].style.display == <span style="font-style: italic;">"none"</span>)
        {
                 x[0].style.display = <span style="font-style: italic;">"block"</span>;
        }
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">it hides the displayed pane on clicking the pane button</span>
        <span style="font-weight: bold;">else</span>
        {
                x[0].style.display = <span style="font-style: italic;">"none"</span>;
        }
};
</pre>
</div>

<ul class="org-ul">
<li><code>sort</code> function to call different functions in this file.
</li>
<li>It calls the <code>reset2</code> function to intialise the variables before sorting.
</li>
<li>Takes the input and handles the array accordingly.
</li>
<li>Calls the subsequent main function to generate the tree.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">sort</span>()
{
  reset2();
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">array</span>=document.getElementById(<span style="font-style: italic;">'arr'</span>).value;
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr</span>=array.split(<span style="font-style: italic;">" "</span>);
  array = array.trim();
        console.log(array);
        merge(array,1);
        mark[1]=1;
        drawGraph();
}
</pre>
</div>

<ul class="org-ul">
<li>Every time a node is clicked and is not opened.
</li>
<li>It generates the top node with id as i and bottom node with id as -i and in the bottom node the array is sorted.
</li>
<li>This add the nodes to the node array that we will use after in the draw to generate the final graph.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">merge</span>(<span style="font-weight: bold; font-style: italic;">arr</span>,<span style="font-weight: bold; font-style: italic;">i</span>)
{
        <span style="font-weight: bold;">if</span>(arr.length&gt;=1)
        {
                vert.push(arr);
                node[i]=arr;
                mark[i]=1;
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">tp1</span>=arr.split(<span style="font-style: italic;">' '</span>);
                console.log(tp1);
                tp1.sort();
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">tp2</span>=tp1.join(<span style="font-style: italic;">" "</span>);
                console.log(tp2);
                node[-i]=tp2;
                vert.push(tp2);
        }
}
</pre>
</div>

<ul class="org-ul">
<li>Main function which handles the drawing of the graph.
</li>
<li>This would use the two node array to get the nodes and
then use the mark to see which edges to add or not according to whether the node is opened or not.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">drawGraph</span>()
{
        <span style="font-weight: bold;">for</span> (v <span style="font-weight: bold;">in</span> node)
        {
                g.setNode(v,{ label: node[v],<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span> });
        }


        <span style="font-weight: bold;">for</span> (v <span style="font-weight: bold;">in</span> node)
        {
                <span style="font-weight: bold;">if</span>(v&gt;0)
                {
                        <span style="font-weight: bold;">if</span>(mark[v]==0) <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">that means no edge from i to -i instead from i to 2*i and 2*i+1</span>
                        {
                                g.setEdge(v,2*v,{label:<span style="font-style: italic;">"Split"</span>});
        g.setEdge(v,2*v+1,{label:<span style="font-style: italic;">"Split"</span>});
                        }
                        <span style="font-weight: bold;">else</span> <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">that means edge from i to -i</span>
                        {
        g.setEdge(v,-v,{label:<span style="font-style: italic;">"MS"</span>});
                        }
                }
                <span style="font-weight: bold;">else</span>
                {
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">dest</span>=Math.floor(v/-2);
                        console.log(v,dest);
                        <span style="font-weight: bold;">if</span>(dest&gt;0)
                        {
        g.setEdge(v,-dest,{label:<span style="font-style: italic;">"Merge"</span>});
                        }
                }
        }
        draw();

}
</pre>
</div>

<ul class="org-ul">
<li>Dagre components.Graph definitions and routine function call to draw the graph.
</li>
<li>In this function to every node we have attached onclick handlers to each node and defined the function which will handle opening and closing.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">g</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
.setGraph({})
.setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">draw</span>()
{
        g.nodes().forEach(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">v</span>)
        {
                 <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node</span> = g.node(v);
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Round the corners of the nodes</span>
                node.rx = node.ry = 5;
        })

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Create the renderer</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">render</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.render</span>();

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Set up an SVG group so that we can translate the final graph.</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">svg</span> = d3.select(<span style="font-style: italic;">"svg"</span>),
        svgGroup = svg.append(<span style="font-style: italic;">"g"</span>);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Run the renderer. This is what draws the final graph.</span>
        render(d3.select(<span style="font-style: italic;">"svg g"</span>), g);
</pre>
</div>

<ul class="org-ul">
<li>Main onclick handler which handles opening and closing of the nodes.
</li>
<li>If mark[v]==1 that implies node is not opened.
</li>
<li>To open this node break the string into two parts and call the merge function with appropriate Ids which will add these nodes to the Node dictionary.
</li>
<li>If mark[v]==0 that means we are clicking on the node to close it.
</li>
<li>If any of its children is open we are not closing the node.
</li>
<li>If both the childrens are closed then we delete them from node array.
</li>
<li>After making the changes we call the reset function and drargraph which redraws the entire graph.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">        d3.select(<span style="font-style: italic;">"svg g"</span>).selectAll(<span style="font-style: italic;">"g.node"</span>)
        .on(<span style="font-style: italic;">"click"</span>, <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">id</span>)
        {
                <span style="font-weight: bold;">if</span>(id&gt;0)
                {
                        <span style="font-weight: bold;">if</span>(mark[id]==1) <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">node is not opened</span>
                        {
                                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">_node</span> = g.node(id);
                                mark[id]=0;
                                console.log(id,_node);
                                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">array</span>=_node.label;
                                console.log(array);
                                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mid</span>=Math.floor(array.length/2);
                                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">tp1</span>=array.substr(0,mid);
                                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">tp2</span>=array.substr(mid,array.length-mid);
                                merge(tp1,2*id);
                                merge(tp2,2*id+1);
                        }
                        <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span>(mark[id]==0)
                        {
                                <span style="font-weight: bold;">if</span>(mark[2*id]==1 &amp;&amp; mark[2*id+1]==1)
                                {
                                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">_node</span> = g.node(id);
                                        mark[id]=1;
                                        console.log(node);
                                        <span style="font-weight: bold;">delete</span> node[2*id];
                                        <span style="font-weight: bold;">delete</span> node[-(2*id)];
                                        <span style="font-weight: bold;">delete</span> node[2*id+1];
                                        <span style="font-weight: bold;">delete</span> node[-(2*id+1)];
                                }

                        }
                        reset();
                        drawGraph();
                }
        });

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Center the graph</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">xCenterOffset</span> = (svg.attr(<span style="font-style: italic;">"width"</span>) - g.graph().width) / 2;
        svgGroup.attr(<span style="font-style: italic;">"transform"</span>, <span style="font-style: italic;">"translate("</span> + xCenterOffset + <span style="font-style: italic;">", 20)"</span>);
        svg.attr(<span style="font-style: italic;">"height"</span>, g.graph().height + 40);

}
</pre>
</div>

<ul class="org-ul">
<li>Reset function which handles the resetting of the graph. 
</li>
<li>One reset handles the resetting of graph when nodes are clicked.
</li>
<li>Other handles the resetting when the reset button is clicked.
</li>
<li><code>reset2</code> function is called before sort is called to intialise all the global variables.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">reset</span>()
{
        g = <span style="font-weight: bold; text-decoration: underline;">null</span>
        g = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
        .setGraph({})
        .setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });

}

<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">reset1</span>()
{
        g = <span style="font-weight: bold; text-decoration: underline;">null</span>
        g = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
        .setGraph({})
        .setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });
        node={};
        vert=[];
        mark=[];
        render = <span style="font-weight: bold; text-decoration: underline;">null</span>
        svg = <span style="font-weight: bold; text-decoration: underline;">null</span>
        document.getElementById(<span style="font-style: italic;">'svg-canvas'</span>).innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
        document.getElementById(<span style="font-style: italic;">'arr'</span>).value = <span style="font-weight: bold; text-decoration: underline;">null</span>

}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">reset2</span>()
{
  g = <span style="font-weight: bold; text-decoration: underline;">null</span>
  g = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
  .setGraph({})
  .setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });
  node={};
  vert=[];
  mark=[];
  render = <span style="font-weight: bold; text-decoration: underline;">null</span>
  svg = <span style="font-weight: bold; text-decoration: underline;">null</span>
  document.getElementById(<span style="font-style: italic;">'svg-canvas'</span>).innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
}
</pre>
</div>
</div>
</div>
